Merge pull request #2 from maximilianuhlmann/bugfix/remove-codesmells
Bugfix/remove codesmells
